
[
    {
        "Abouts":
        [
            {
                "nama": "Rizki Putra Utama Endriansyah",
                "whatMe": "IT Developer",
                "homeImg": "./img/profile-img.png",
                "aboutImg": "./img/about-img.png",
                "Aboutme" : "Perkenalkan, nama saya Rizki Putra Utama Endriansyah. S1 Teknik informatika dari Universitas Kajuruhan malang. Selama kuliah, saya berhasil dapat pendanaan di bidang kemahasiswaan dan aktif berorganisasi dalam kampus. Sebelumnya, saya pernah magang sebagai game desaider dan IoT Depeloper. Saya sangat menyukai pekerjaan yang berhubungan dengan Teknologi Informasi dan perangkat keras dan memiliki kemampuan untuk dengan cepat belajar.",
                "email" : "rizkiutama379@gmail.com",
                "phone" : "+62 85850663731"
            }
        ]
    },
    {
        "skills" : ["Python", "Javascripts", "Bootstrap", "IoT", "odoo","Perencanaan dan Pengorganisasian","DesainGrafis"]
    },
    {
        "social":
        [
            {
                "platform" : "linkedin",
                "link" : "https://www.linkedin.com/in/rizki-desu-018858196",
                "icon" : "fab fa-linkedin"
            },
            {
                "platform" : "Github",
                "link" : "https://github.com/RizkiDesu",
                "icon" : "fab fa-github"
            },
            {
                "platform" : "Instagram",
                "link" : "https://www.instagram.com/sayap.kegelapan/",
                "icon" : "fab fa-instagram"
            },
            {
                "platform" : "Facebook",
                "link" : "https://www.facebook.com/profile.php?id=100078904287291",
                "icon" : "fab fa-facebook"
            },
            {
                "platform" : "Youtube",
                "link" : "https://www.youtube.com/channel/UC7sf34Z7pVKucV-E6r0_DPA",
                "icon" : "fab fa-youtube"
            },
            {
                "platform" : "Twitter",
                "link" : "https://twitter.com/rizki_desu",
                "icon" : "fab fa-twitter"
            }
            
        ]
    },
    {
        "project":
        [
            {
                "namaproject": "Kwh Meter IoT",
                "imglokasi": "./img/portfolio/KWHMETER.JPG",
                "deskripsi": "Dibuat dalam rangka magang di PT. Inovasi Teknologi Desa. Aplikasi ini bertujuan untuk memonitoring daya listrik rumah tangga dengan menggunakan teknologi IoT berbasis website.",
                "dibuatpada": "Juni 2021",
                "teknologi": "HTML, CSS, JavaScript, PHP, MySQL, ESP8266",
                "role" : "Fullstack Developer",
                "link": "https://github.com/RizkiDesu/kwh_meter"
            },
            {
                "namaproject": "Deteksi Katarak",
                "imglokasi": "./img/portfolio/deteksi_katarak.png",
                "deskripsi": "Dibuat dalam rangka lomba hackaton bpjs yang di selengarakan oleh bpjs kesehatan. Aplikasi ini bertujuan untuk mendeteksi katarak pada mata dengan menggunakan teknologi computer vision berbasis website.",
                "dibuatpada": "Agustus 2023",
                "teknologi": "Python, Flask, HTML, CSS, JS",
                "role" : "Fullstack Developer",
                "link": "https://github.com/RizkiDesu/deteksi_katarak"
            },
            {
                "namaproject": "Alien Anu Tech-GGJ",
                "imglokasi": "./img/portfolio/anutechteam.jpeg",
                "deskripsi": "Dibuat dalam rangka global game jam 2020. Game ini bertema tentang alien yang mencoba untuk kembali ke planet asalnya. Game ini dibuat dengan menggunakan unity engine dan pixel art.",
                "dibuatpada": "January 2020",
                "teknologi": "Photoshop, Unity Engine, C#",
                "role" : "pixel artist",
                "link": "https://v3.globalgamejam.org/2020/games/alien-anutech-2"
            }
        ]
    },
    {
        "educations":
        [
            {
                "instansi": "Universitas PGRI Kajuruhan Malang",
                "jurusan": "S1 Teknik Informatika",
                "nilaiAkhir": "IPK : 3.56/4.0",
                "tahun": "Mei 2019 - Sep 2023",
                "deskripsi" : "Saya mengambil jurusan Teknik Informatika di Universitas PGRI Kajuruhan Malang. Selama kuliah, saya berhasil dapat pendanaan di bidang kemahasiswaan dan aktif berorganisasi dalam kampus.",
                "list" : 
                [
                    "Program Pembinaan Mahasiswa Wirausaha (P2MW), Lolos Pendanaan, Tahun 2022.",
                    "Program Inovasi Wirausaha Digital Mahasiswa (IWDM), Lolos Pendanaan, Tahun 2022",
                    "Penelitian Bidang IoT Rancang Bangun Sistem Aplikasi Monitoring Daya Listrik Rumah Berbasis Android",
                    "Penelitian Bidang Computer Vision Objek Human Tracking Menggunakan Algoritma Camshift"
                ]
            }
        ]
    },
    {
        "eperiences":
        [
            {
                "instansi": "SMAN Annur Bululawang",
                "posisi": "GURU Honorer TIK",
                "tahun": "Juli 2023 - Sekarang",
                "deskripsi" : "Saya bekerja sebagai guru TIK di SMAN Annur Bululawang. Selama bekerja, saya berhasil membuat materi pembelajaran yang menarik dan mudah dipahami oleh siswa.",
                "list" : 
                [
                    "Memberikan pelajaran tentang konsep dasar teknologi informasi, pemrograman, desain grafis, atau topik TIK lainnya.",
                    "Mengelola perangkat keras dan perangkat lunak komputer di kelas. Memastikan ketersediaan sumber daya pendukung, seperti proyektor koneksi internet dll.",
                    "Mempromosikan penggunaan teknologi dalam proses pembelajaran, termasuk pemanfaatan platform pembelajaran digital.",
                    "Memberikan dukungan teknis bagi siswa yang menghadapi masalah teknologi."
                ]
            },
            {
                "instansi": "PT. Inovasi Teknologi Desa",
                "posisi": "Magang IoT Developer",
                "tahun": "Feb 2022 - Mei 2022",
                "deskripsi" : "Saya magang di PT. Inovasi Teknologi Desa sebagai IoT Developer. Selama magang, saya berhasil membuat aplikasi monitoring daya listrik rumah tangga dengan menggunakan teknologi IoT berbasis website.",
                "list" : 
                [
                    "Menganalisis kebutuhan perangkat lunak atau aplikasi yang akan dikembangkan. Merancang struktur dan arsitektur sistem.",
                    "Menulis kode program dengan menggunakan bahasa pemrograman.",
                    "Membuat dokumentasi yang lengkap untuk kode program yang telah dibuat."
                ]
            },
            {
                "instansi": "LEDMA AL-FARABI Univ Univ. PGRI Kanjuruhan Malang",
                "posisi": "Ketua Bidang 4",
                "tahun": "Jan 2021 - Jan 2022",
                "deskripsi" : "Pengalaman organisasi saya di LEDMA AL-FARABI Universitas PGRI Kanjuruhan Malang. Saya menjabat sebagai Ketua Bidang 4 (Medkominfo dan Humas).",
                "list" : 
                [
                    "Mengevaluasi kinerja organisasi secara rutin. Mengidentifikasi area peningkatan dan mengimplementasikan perubahan yang diperlukan.",
                    "Mengambil keputusan yang strategis untuk kebaikan organisasi dengan mempertimbangkan masukan dari anggota dan tim dan bertanggung jawab atas keberhasilan atau kegagalan keputusan yang diambil."
                ]
            },
            {
                "instansi": "Magesoft Studio",
                "posisi": "Game Desain & Programmer",
                "tahun": "Jun 2021 - Des 2021",
                "deskripsi" : "Magangang di Magesoft Studio yang berlokasi di kota Malang. kami membuat game dengan menggunakan Unity Engine kerja remote.",
                "list" : 
                [
                    "Menguji permainan untuk mengidentifikasi bug atau masalah teknis",
                    "Membantu dalam merancang level atau konten permainan.",
                    "Membantu dalam penulisan skenario, dialog, atau konten naratif permainan."
                ]
            },
            {
                "instansi": "HMPSTI Univ. PGRI Kanjuruhan Malang",
                "posisi": "KETUA UMUM",
                "tahun": "Jan 2021 - Jan 2022",
                "deskripsi" : "Pengalaman organisasi saya di HMPSTI Universitas PGRI Kanjuruhan Malang. Saya menjabat sebagai Ketua Umum HMPSTI.",
                "list" : 
                [
                    "Mengambil keputusan yang strategis untuk kebaikan organisasi dengan mempertimbangkan masukan dari anggota dan tim dan bertanggung jawab atas keberhasilan atau kegagalan keputusan yang diambil",
                    "Merancang dan mengimplementasikan rencana strategis untuk mencapai tujuan organisasi.",
                    "Menjaga komunikasi yang efektif antara anggota organisasi",
                    "Mengidentifikasi area peningkatan dan mengimplementasikan perubahan yang diperlukan.",
                    "Menjadi organisasi di forum publik. Memperjuangkan kepentingan organisasi."
                ]
            }
        ]
    }
]
  